---
kind: method
id: M:Autodesk.Revit.DB.DefaultOpenFromCloudCallback.Dispose
source: html/ba95c964-76fd-49fe-009e-4b27deaf3b9b.htm
---
# Autodesk.Revit.DB.DefaultOpenFromCloudCallback.Dispose Method

Releases all resources used by the DefaultOpenFromCloudCallback

## Syntax (C#)
```csharp
public void Dispose()
```